## MINI-PROJECT 1

## Read the data

In [1]:
import pandas as pd
df=pd.read_excel(r"C:\Users\hp\PYTHON\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

## Exploring data

In [2]:
df.head()

        Date      City  Temperature_C  Humidity_% Condition
0 2025-01-01  Hyderbad             28          60     Sunny
1 2025-01-02  Hyderbad             29          62     Sunny
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [3]:
df.head(10)

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [4]:
df.tail()

        Date        City  Temperature_C  Humidity_% Condition
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [5]:
df.tail(7)

        Date        City  Temperature_C  Humidity_% Condition
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     datetime64[ns]
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 532.0+ bytes

In [8]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
df.dtypes

Date             datetime64[ns]
City                     object
Temperature_C             int64
Humidity_%                int64
Condition                object
dtype: object

In [11]:
df.Date

0   2025-01-01
1   2025-01-02
2   2025-01-03
3   2025-01-04
4   2025-01-05
5   2025-01-06
6   2025-01-07
7   2025-01-08
8   2025-01-09
9   2025-01-10
Name: Date, dtype: datetime64[ns]

In [12]:
df.City

0      Hyderbad
1      Hyderbad
2      Hyderbad
3      Hyderbad
4      Banglore
5      Banglore
6      Banglore
7      Banglore
8    Vijayawada
9    Vijayawada
Name: City, dtype: object

In [13]:
df.shape

(10, 5)

In [14]:
df[2:5]

        Date      City  Temperature_C  Humidity_% Condition
2 2025-01-03  Hyderbad             30          58    Cloudy
3 2025-01-04  Hyderbad             31          55    Cloudy
4 2025-01-05  Banglore             32          57     Rainy

In [15]:
df[['Date','Condition']]

        Date Condition
0 2025-01-01     Sunny
1 2025-01-02     Sunny
2 2025-01-03    Cloudy
3 2025-01-04    Cloudy
4 2025-01-05     Rainy
5 2025-01-06     Rainy
6 2025-01-07     Sunny
7 2025-01-08    Cloudy
8 2025-01-09     Rainy
9 2025-01-10     Sunny

In [25]:
Data={
    'Name':['Aruna','Tulasi','Moina','Sravanthi','Manasa','Devi','Sriya','Roshini','Jaya','Anitha','Hannah'],
    'Age':[21,20,20,19,19,19,20,20,21,20,19],
    'Branch':['BCA','BCA','BCA','BSC','BSC','BBA','BBA','BCA','BBA','BSC','BCA'],
    'Marks':[100,99,98,95,93,89,94,79,88,90,91],
    'Location':['kkd','kkd','kkd','kkd','hyd','hyd','hyd','vjy','vjy','rjy','rjy']
}
df=pd.DataFrame(Data)
df

         Name  Age Branch  Marks Location
0       Aruna   21    BCA    100      kkd
1      Tulasi   20    BCA     99      kkd
2       Moina   20    BCA     98      kkd
3   Sravanthi   19    BSC     95      kkd
4      Manasa   19    BSC     93      hyd
5        Devi   19    BBA     89      hyd
6       Sriya   20    BBA     94      hyd
7     Roshini   20    BCA     79      vjy
8        Jaya   21    BBA     88      vjy
9      Anitha   20    BSC     90      rjy
10     Hannah   19    BCA     91      rjy

In [26]:
df.head()

        Name  Age Branch  Marks Location
0      Aruna   21    BCA    100      kkd
1     Tulasi   20    BCA     99      kkd
2      Moina   20    BCA     98      kkd
3  Sravanthi   19    BSC     95      kkd
4     Manasa   19    BSC     93      hyd

In [27]:
df.head(8)

        Name  Age Branch  Marks Location
0      Aruna   21    BCA    100      kkd
1     Tulasi   20    BCA     99      kkd
2      Moina   20    BCA     98      kkd
3  Sravanthi   19    BSC     95      kkd
4     Manasa   19    BSC     93      hyd
5       Devi   19    BBA     89      hyd
6      Sriya   20    BBA     94      hyd
7    Roshini   20    BCA     79      vjy

In [28]:
df.tail()

       Name  Age Branch  Marks Location
6     Sriya   20    BBA     94      hyd
7   Roshini   20    BCA     79      vjy
8      Jaya   21    BBA     88      vjy
9    Anitha   20    BSC     90      rjy
10   Hannah   19    BCA     91      rjy

In [29]:
df.tail(9)

         Name  Age Branch  Marks Location
2       Moina   20    BCA     98      kkd
3   Sravanthi   19    BSC     95      kkd
4      Manasa   19    BSC     93      hyd
5        Devi   19    BBA     89      hyd
6       Sriya   20    BBA     94      hyd
7     Roshini   20    BCA     79      vjy
8        Jaya   21    BBA     88      vjy
9      Anitha   20    BSC     90      rjy
10     Hannah   19    BCA     91      rjy

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      11 non-null     object
 1   Age       11 non-null     int64
 2   Branch    11 non-null     object
 3   Marks     11 non-null     int64
 4   Location  11 non-null     object
dtypes: int64(2), object(3)
memory usage: 572.0+ bytes

In [31]:
df.columns

Index(['Name', 'Age', 'Branch', 'Marks', 'Location'], dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=11, step=1)

In [33]:
df.dtypes

Name        object
Age          int64
Branch      object
Marks        int64
Location    object
dtype: object

In [34]:
df.Name

0         Aruna
1        Tulasi
2         Moina
3     Sravanthi
4        Manasa
5          Devi
6         Sriya
7       Roshini
8          Jaya
9        Anitha
10       Hannah
Name: Name, dtype: object

In [35]:
df.Marks

0     100
1      99
2      98
3      95
4      93
5      89
6      94
7      79
8      88
9      90
10     91
Name: Marks, dtype: int64

In [36]:
df.shape

(11, 5)

In [38]:
df[2:5]

        Name  Age Branch  Marks Location
2      Moina   20    BCA     98      kkd
3  Sravanthi   19    BSC     95      kkd
4     Manasa   19    BSC     93      hyd

In [39]:
df[['Name','Marks']]

         Name  Marks
0       Aruna    100
1      Tulasi     99
2       Moina     98
3   Sravanthi     95
4      Manasa     93
5        Devi     89
6       Sriya     94
7     Roshini     79
8        Jaya     88
9      Anitha     90
10     Hannah     91

In [40]:
df[['Name','Marks','Branch']]

         Name  Marks Branch
0       Aruna    100    BCA
1      Tulasi     99    BCA
2       Moina     98    BCA
3   Sravanthi     95    BSC
4      Manasa     93    BSC
5        Devi     89    BBA
6       Sriya     94    BBA
7     Roshini     79    BCA
8        Jaya     88    BBA
9      Anitha     90    BSC
10     Hannah     91    BCA